import Container from "@/components/shared/Ui/Container";
import SectionTitle from "@/components/shared/Ui/SectionTitle";
import { IMAGES } from "@/image-data";
import ReviewsSlider from "./ReviewsSlider";

const testimonials = [
  {
    id: "1",
    name: "হুমাইরা আক্তার",
    photo: IMAGES.home.Testimonials.GirlAvatar1,
    message: `আসসালামু আলাইকুম হুজুর,
আপনার থেকে বিদায় নিতে পারিনি, তাই কথাও বলা হয়নি। দীর্ঘদিন আপনি আমাদের অনেক ধৈর্য নিয়ে পড়িয়েছেন — এজন্য অন্তর থেকে অসংখ্য দোয়া আপনার জন্য।
আমি জীবনে অনেক দূর পড়াশোনা করেছি, এখন নিজেও বিশ্ববিদ্যালয়ে পড়াই, কিন্তু আপনার কোর্সটি করে যে মানসিক শান্তি পেয়েছি, তা কোনো পড়াশোনাই আমাকে দিতে পারেনি।
কয়েকটি ক্লাস করতে পারিনি, তখন আপনি যে আন্তরিকভাবে ক্ষমা করেছেন — তার জন্য কৃতজ্ঞ।
ইচ্ছে ছিল পুরো কুরআনটা শেষ করব, কিন্তু ব্যস্ততার কারণে এখন পারছি না। ইনশাআল্লাহ, পরে অবশ্যই সম্পন্ন করব।
আল্লাহ তায়ালা আপনার দাওয়াতি কাজকে কবুল করুন। 🤍`,
  },
  {
    id: "2",
    name: "সাবিকুন নাহার",
    photo: IMAGES.home.Testimonials.GirlAvatar2,
    message: `কুরআন পাঠ করতে পারতাম না — এমন নয়। তবে অনেক রুলস বা নিয়ম ঠিকভাবে জানা ছিল না, তাই পড়ার সময় প্রায়ই আটকে যেতাম।
সত্যি বলতে, এই প্ল্যাটফর্মে এসে ইয়াসীন হুজুর আমাদের শিখিয়ে দিলেন — কীভাবে আল্লাহ সুবহানাহু ওয়া তায়ালার এই মহামূল্যবান কিতাবকে অন্তরে জায়গা দিতে হয়।
আলহামদুলিল্লাহ, এখন যতটুকু জানি, ততটুকু নিয়ম মেনে পড়তে পারি। আগের মতো আর আটকাই না; বরং অনেক সময় সুরও বের হয়।
বিশেষ করে নাজেরা ক্লাসটা আমার জীবনে অনেক উপকার করেছে।
উনাদের ক্লাস নেওয়ার পদ্ধতি আমাদের মতো সাধারণ শিক্ষার্থীদের জন্য একদম পারফেক্ট! ব্যক্তিগত কিছু সমস্যার কারণে পুরো কোর্স শেষ করতে পারিনি, তবে অভিজ্ঞতা সত্যিই অনন্য।
দোয়া রইল এই একাডেমির সকল হুজুরদের জন্য —
আল্লাহ তায়ালা যেন তাঁদের মাধ্যমে আমাদের মতো ত্রুটিপূর্ণ মানুষদের দ্বীনের পথে আরও সুন্দরভাবে এগিয়ে যাওয়ার তাওফিক দান করেন। 🤲`,
  },
  {
    id: "3",
    name: "আব্দুল কাদের",
    photo: IMAGES.home.Testimonials.BoyAvatar1,
    message: `আলহামদুলিল্লাহ, ক্লাসের মান অনেক ভালো।
আমার বিশ্বাস, অনলাইনের এই কোর্সের মাধ্যমে সর্বাধিক মানুষ কুরআন পড়তে সক্ষম হবেন।
আমি নিজেও একটি কোর্স সম্পন্ন করেছি — এখন আমি কুরআন তিলাওয়াত করতে পারি, আলহামদুলিল্লাহ। 🌸`,
  },
  {
    id: "4",
    name: "মিনহাজুল আরিফিন",
    photo: IMAGES.home.Testimonials.BoyAvatar2,
    message: `আলহামদুলিল্লাহ, এই প্রতিষ্ঠানের কুরআন শিক্ষা কোর্সটি অনন্য।
আমার দৃঢ় বিশ্বাস, এই পদ্ধতিটি যদি আরও ব্যাপকভাবে ছড়িয়ে দেওয়া যায়, অসংখ্য মানুষ কুরআন শিখতে আগ্রহী হবে।
মাত্র ৫০টি নাজেরা ক্লাস শেষে এমন সুন্দর তিলাওয়াত করতে পারব — তা কখনো কল্পনাও করিনি।
আল্লাহ আপনাদের এই খেদমত কবুল করুন এবং বিশ্বজুড়ে ছড়িয়ে দিন।
সামনে তাফসির, হাদিস ও ফিকাহ বিষয়েও কোর্স চালুর অনুরোধ জানাচ্ছি।
আপনাদের শেখানোর পদ্ধতিটি সত্যিই অসাধারণ। দোয়া রইল আপনাদের জন্য। 🌿`,
  },
];

const Testimonials = () => {
  return (
    <Container className="py-16 lg:py-20">
      <SectionTitle text="আমাদের প্রতি শিক্ষার্থীদের ভালোবাসা" />

      <ReviewsSlider reviews={testimonials} />
    </Container>
  );
};

export default Testimonials;
